{
    "basic_info": {
      "description_header": "Hi",
      "description": "As a highly motivated and technically proficient software engineer, I bring a strong foundation in both frontend and backend development, specializing in React.js, Spring Boot, and AWS. I hold a Master’s degree in Computer Science from Indiana University, where I contributed to significant performance improvements in various projects. My experience spans from optimizing backend systems with Java and PostgreSQL to developing responsive user interfaces with React.js. With hands-on expertise in microservices architecture, RESTful APIs, and cloud deployment using Docker and Kubernetes, I am committed to leveraging cutting-edge technologies to deliver scalable and efficient solutions. My dedication to continuous learning is reflected in my certifications in AWS, Azure, and MongoDB, and I thrive in dynamic environments where I can solve complex technical challenges and drive innovation.",
      "section_name": {
        "about": "About me",
        "education": "Education",
        "experience": "Experience",
        "skills": "Skills",
        "projects": "Projects",
        "research_achievements":"Research Achievements"                
      }
    },
    "education":[
      {
        "institution_name":"Amrita Vishwa Vidyapeetham",
        "degree_name":"Bachelor of Technology",
        "major":"Electronics and Communication",
        "start_ts":"Aug 2017",
        "end_ts":"May 2021",
        "gpa":"9.18",
        "gpa_total":"10"
      },
      {
        "institution_name":"Indiana University Bloomington",
        "degree_name":"Master of Science",
        "major":"Computer Science",
        "start_ts":"Aug 2022",
        "end_ts":"May 2025",
        "gpa":"3.91",
        "gpa_total":"4"
      }
    ],
    "projects": [
      {
        "title": "Stock Recommendation Website",
        "startDate": "2022",
        "description": "Built a website using Angular for user interaction, incorporating NgRx for state management and Node.js for API development to enable seamless frontend and backend communication, and hosted the application on Firebase.",
        "images": [
          "images/portfolio/stocks/p1.jpg",
          "images/portfolio/stocks/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Pneumonia Detection System",
        "startDate": "2023",
        "description": "Designed and deployed a COVID-19 and pneumonia detection website on AWS, with ReactJS for Frontend, Sageamaker to train the model, AWS S3 to host and store the user x-ray, AWS Lambda to trigger AWS Sagemaker to classify the X-ray.",
        "images": [
          "images/portfolio/pneumonia/p1.png",
          "images/portfolio/pneumonia/p2.png",
          "images/portfolio/pneumonia/p3.png",
          "images/portfolio/pneumonia/p4.png",
          "images/portfolio/pneumonia/p5.png"
          
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Motel Management System",
        "startDate": "2015",
        "description": "Engineered a comprehensive hotel booking and recommendation Website for customers and hotel owners using ReactJs technologies at client, Java Spring Boot at server side and MYSQL, achieving operational efficiency of 25%.",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Indiana University",
        "title": "Reasearch Analyst",
        "years": "05.2023 - 05.2024",
        "mainTech": [
          "React.js, Spring Boot, Spring Cloud(Eureka, Api Gateway)"
        ],
        "technologies": [
          "REST API",
          "Spring Boot",
          "JavaScript",
          "Next.js",
          "Tailwind CSS",
          "Webpack",
          "PostgreSQL",
          "MongoDB",
          "AWS",
          "JWT"
        ],
        "description":"At Indiana University, I improved SQL query performance, integrated server-side solutions with Spring Boot, and enhanced client-side functionality with React.js. I also managed infrastructure optimizations, leveraged AWS services for scaling, and adhered to Agile methodologies to boost productivity. My technical expertise includes Java, Spring Framework, React, AWS, and various databases, with a focus on performance optimization and scalable architecture."

      },
      {
        "company": "Sify Technologies",
        "title": "Software Engineer",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt",
          "Spring Boot"
        ],

        "description":"I worked as a Software Engineer where I focused on enhancing data accessibility and integrating it with Angular to create responsive user interfaces, which improved overall performance by 15%. I was responsible for maintaining RESTful APIs using Java and Spring Boot, and my efforts helped reduce server response times by 20%. I also implemented DevOps practices, including CI/CD pipelines with Jenkins and Docker for version control, which streamlined our development process. My work with Hibernate, JDBC, and Flowable was crucial in ensuring efficient data operations within our microservices architecture. Additionally, I configured Swagger in Spring MVC and developed APIs using AWS Lambda to facilitate seamless data retrieval from SQL databases."

      },

      {
        "company": "Sling Media",
        "title": "Software Engineer",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "ReactJS",
          "Django",
          "PHP",
          "JavaScript",
          "AWS",
          "Microservices",
          "MongoDB",
          "Spring"
        ],

        "description":"I contributed as a Software Engineer, where I developed key modules of Sling TV, specifically the Guide and Home modules, using React.js. This work led to a 25% increase in user engagement by optimizing content delivery and improving the user interface. I also played a key role in integrating our frontend and backend systems with AWS-based media streaming microservices, using MongoDB for data storage and React for content rendering. Furthermore, I worked extensively with REST APIs and microservices using Spring, and I utilized Kubernetes for scalable deployments. My responsibilities also included writing Oracle SQL queries and PL/SQL procedures to manage data within our databases, and I implemented the Spring framework to support dependency injection and data access patterns."
      }
    ]
}